In [1]:
import numpy as np 
import pandas as pd

1. Create a Pandas Series from a list of 10 random integers and calculate its mean.
2. Create a DataFrame from a dictionary with columns 'Name', 'Age', and 'City'.
3. Access the first 5 elements of a Pandas Series using slicing.
4. Add a new column 'Score' to a DataFrame with values [85, 90, 78, 92].
5. Use .iloc to access the first row of a DataFrame.
6. Use .loc to select the rows where 'Age' is 25 in a DataFrame.
7. Create a Series with a custom index ['a', 'b', 'c'] and access the value at index 'b'.
8. Calculate the standard deviation of a Series containing numerical values.
9. Create a DataFrame and drop the 'City' column using the drop method.
10. Filter a DataFrame to show rows where 'Age' is greater than 30 using boolean indexing.
11. Apply a lambda function to a DataFrame column to square the values.
12. Use .iloc to select the last 3 rows of a DataFrame.
13. Rename the 'Name' column to 'FullName' in a DataFrame and display the DataFrame.
14. Use .loc to select rows based on a condition and specific columns.
15. Create a DataFrame from a list of lists with columns ['A', 'B', 'C'] and calculate the mean of each column.
16. Load the Titanic dataset from kaggle into a DataFrame and display the first 5 rows.
17. Calculate the correlation matrix of a DataFrame with numerical columns from the Wine Quality dataset .
18. Create a DataFrame with a 'Date' column and set it as the index, then resample the data by month.

In [10]:
list =[np.random.randint(10) for x in range(10)]
print(list)
q1=pd.Series(list)
print(q1)

[2, 9, 0, 8, 4, 0, 0, 5, 0, 7]
0    2
1    9
2    0
3    8
4    4
5    0
6    0
7    5
8    0
9    7
dtype: int64

In [17]:
sample={
    'Name':['Smayan','Vedant','Gadge','Sarthaak','Neelam'],
    'Age':[92,43,25,66,56],
    'City' :['Mumbai' for x in range(5)]
}

q2_dict=pd.DataFrame(sample)
q2_dict.head()

       Name  Age    City
0    Smayan   92  Mumbai
1    Vedant   43  Mumbai
2     Gadge   25  Mumbai
3  Sarthaak   66  Mumbai
4    Neelam   56  Mumbai

In [18]:
q1[:5]

0    2
1    9
2    0
3    8
4    4
dtype: int64

In [19]:
q2_dict['Score']= [85, 90, 78, 92,32]
q2_dict.head()

       Name  Age    City  Score
0    Smayan   92  Mumbai     85
1    Vedant   43  Mumbai     90
2     Gadge   25  Mumbai     78
3  Sarthaak   66  Mumbai     92
4    Neelam   56  Mumbai     32

In [20]:
q2_dict.iloc[0]

Name     Smayan
Age          92
City     Mumbai
Score        85
Name: 0, dtype: object

In [24]:
q2_dict.loc[q2_dict['Age']==25]

    Name  Age    City  Score
2  Gadge   25  Mumbai     78

In [26]:
q3=pd.Series([13,24,34],index=['a','b','c'])
q3.head()

a    13
b    24
c    34
dtype: int64

In [27]:
q3.loc['b']

24

In [29]:
print(f"Standard Deviation for the above series is : {np.std(q3)}")

Standard Deviation for the above series is : 8.576453553512405